In [1]:
import pandas as pd

In [5]:
url="https://raw.githubusercontent.com/AileshC/PythonLearning/master/salary.csv"

In [6]:
url

'https://raw.githubusercontent.com/AileshC/PythonLearning/master/salary.csv'

In [8]:
df = pd.read_csv(url)

In [9]:
df

   Salary
0    3003
1    6789
2    4567
3    6687
4    3536